import test from "@/test";

export default {
    theme: {
        normal: [
            "#C9B5B8", "#E7CAD6", "#E6C1A1", "#66B98F", "#A6A9E2",
            "#7F66FF", "#66A6FF", "#99FFC4", "#82ECFF", "#B08446",
            "#9C9C97", "#CFD69C", "#9DB881", "#F74545", "#0AA4BF",
            "#BAEDFF", "#6666E2", "#FEFF81", "#DBEFA5", "#A5B3C2",
            "#D8E5E1", "#6198A4", "#FF8587", "#F1E3A7", "#D5DFF2",
            "#A5EFDC", "#FFD7D7", "#A9A9F0", "#E6D8A7", "#ADF3FF",
        ]
    },
    beginDate: new Date("2021-09-06"), // 第一周周一
    days: ["周一", "周二", "周三", "周四", "周五", "周六", "周日"],
    times: ["8:00~8:50", "8:55~9:45", "10:00~10:50", "10:55~11:45",
        "13:45~14:35", "14:40~15:30", "15:45~16:35", "16:40~17:30",
        "18:30~19:20", "19:25~20:15", "20:30~21:20", "21:25~22:15"
    ],
    totalWeek: 17,
    schedule: test.classes
}
